//
//  ImageData.swift
//  midExam
//
//  Created by Leo on 6/17/16.
//  Copyright © 2016 Leo. All rights reserved.
//

import UIKit

class ImageData: NSObject {
    static var images = [ImageData(name:"NYSM2", descriptions: "《出神入化2》是一部2016年上映的美國魔術犯罪懸疑電影，由朱浩偉執導。本片為2013年電影《出神入化》的續集。電影主演包括傑西·艾森柏格、馬克·魯法洛、伍迪·哈里遜、麗茲·凱普蘭、丹尼爾·雷德克里夫、戴夫·弗蘭科、米高·肯恩、摩根·費里曼和周杰倫。", launchDate:"2016/06/09"), ImageData(name:"Warcraft", descriptions:"改編自暴雪娛樂2004年的電玩遊戲「魔獸世界」，至今全世界超過一億名玩家，電影版籌拍超過十年。《啟動原始碼》[鄧肯瓊斯]導演執導，影集《維京傳奇》[崔維斯費米爾]、《不可能的任務：鬼影行動》[寶拉巴頓]、《驚奇4超人》[托比凱貝爾]、《紅翼行動》[班佛斯特]、《美國隊長2：酷寒戰士》[多明尼克庫柏]、《環太平洋》[羅伯卡辛斯基]和《魔警》[吳彥祖]主演。 故事敘述兩個截然不同的世界首次展開激烈衝突，一直以來祥和平靜的艾澤拉斯國度即將面臨一場足以摧毀人類文明的大戰，一群驍勇善戰、魁梧壯碩的獸人戰士逃離他們瀕死的家園，來到人類世界，準備佔領這片土地，建立屬於他們的全新家園。一道連結這兩個世界的大門即將打開，而人類必須為了捍衛自己的家園而奮戰，獸人則為了避免種族滅亡而展開侵略。對立的兩方各有一位英雄挺身而出，激戰一觸即發，雙方的同胞以及家園的命運也將就此決定。 在人類安居樂業的艾澤拉斯，光明與黑暗的魔法是這個世界的生命力量來源，也是決定這此地萬物命運自然秩序的一環。人類國度由萊恩國王（[多明尼克庫柏] 飾）以及他的妻子泰莉雅王后（[露絲奈嘉] 飾）統治，他們是仁慈的君主，居住在祥和寧靜的暴風城。從小就和萊恩王一起並肩作戰的是驍勇善戰的戰士安杜因洛薩（[崔維斯費米爾] 飾），他也是艾澤拉斯軍隊的指揮官。這個和平的王國多年來享受著富饒的生活，並且受到名為祈倫托的法師議會保護，這些法師個個法力高強，他們住在雲霧之間的浮空之城達拉然，高高在上地維持著這個世界各種力量的平衡。 艾澤拉斯的守護者麥迪文（[班佛斯特] 飾）是這個世界力量最強大的法師，他和萊恩國王以及洛薩共同承擔不計任何代價護衛所有國民的重責大任。但年輕的法師卡德加（[班史奈澤] 飾）決定脫離祈倫托這個古老的議會，找尋更崇高的真理。當艾澤拉斯面對一場大戰的來臨，他的尋道之旅將讓他和洛薩相遇，最後甚至改變所有人的命運。 在另一個平行宇宙，德拉諾則是獸人這個種族的家園，獸人既驕傲又野蠻，他們的歷史寫滿了戰爭與苦難。這群長著倒勾尖牙的戰士平均身高有2.4公尺，全身披著量身訂造的盔甲和各種鐵鑄的武器，他們全都驍勇善戰、銳不可擋，天生就是戰士，從小就學習各種生存之道。但獸人的世界瀕臨死亡，如果他們想要存活，就必須捨棄原來的家園，前往另一個世界。若代表他們必須侵略並占領另一個世界，他們也非戰不可。 他們的領袖是狡詐暴虐的術士古爾丹（[吳彥祖] 飾），他可能是獸人種族的救世主。他運用黑暗無比、極度危險的魔能，開啟了一道通往全新世界的大門。他的左右手是勇猛雄壯的大酋長黑手（[克藍西布朗] 飾），他集結了各個已經無路可退的獸人氏族，形成一支稱為部落的大軍。雖然其他氏族的酋長都服從古爾丹的命令侵略艾澤拉斯並且消滅所有人類，但卻仍有一個獸人勇敢抗命。 霜狼氏族備受愛戴的酋長杜洛坦（[托比凱貝爾] 飾）記得邪惡的古爾丹奪權之前，獸人的生活樸實簡單、充滿榮耀。雖然杜洛坦對古爾丹的計劃有所懷疑並心感不安，他和妻子德拉卡（[安娜葛雯] 飾）、副手奧格林（[羅伯卡辛斯基] 飾）以及整個霜狼氏族的族人仍然加入其他獸人的行列，按照計劃通過大門前往艾澤拉斯。雖然他們深怕這股讓他們進入人類世界的死亡魔能會帶來可怕的災難，但如果他們想延續氏族的未來，難道還有別的選擇嗎？ 當他失去家園的同胞終於來到艾澤拉斯時，杜洛坦開始思考是否有和平的方法在人類的世界建立新家園。這麼想的人不是只有他一個。迦羅娜（[寶拉巴頓] 飾）是個美麗的混血半獸人，但她卻覺得自己不屬於兩邊的陣營。她最終是會效忠於把她當作奴隸的獸人部落，或者是解救了她，給她自由的人類世界呢？ 當黑暗之門終於開啟，兩支大軍開始正面交鋒，人類世界面對即將來臨的災難，獸人世界則面臨種族滅亡的危機，當這兩個世界都命懸一線，敵對陣營的兩名英雄──洛薩和杜洛坦，決定挺身而出，質疑戰爭是不是唯一的答案。 除了風景和河流外景，本片98%的比例是在棚內拍攝，總共在9座不同的攝影棚內搭景，戲服則由各國設計師打造了650套的戲服，而為了戰爭場面，則打造了150把的長劍和盾牌。", launchDate:"2016/06/10")]
    
    var name: String
    var descriptions: String
    var launchDate: String
    
    init(name: String, descriptions: String, launchDate: String){
        self.name = name
        self.descriptions = descriptions
        self.launchDate = launchDate
    }

}
